package dev.dmitry;

public class Game {







//    private pre-game setup





























//    public void greetThePlayer(){
//        System.out.println("Привет, игрок! Добро пожаловать в игру \"Виселица\"!\n" +           // надо будет перевести нах
//                "\n" +
//                "Правила игры:\n" +
//                "Я загадываю случайное слово — имя существительное в именительном падеже.\n" +
//                "Вы видите пустую виселицу и количество букв в слове (в виде скрытых символов, например: _ _ _ _ _).\n" +
//                "Ваша задача — по одной угадывать буквы, которые могут входить в это слово.\n" +
//                "Если угаданная буква есть в слове — она открывается во всех местах, где встречается.\n" +
//                "Если буквы нет — добавляется часть тела к виселице.\n" +
//                "Всего у вас 6 попыток.\n" +
//                "Если тело нарисовано полностью — вы проиграли.\n" +
//                "Если откроете все буквы — вы победили!\n" +
//                "После победы или поражения вы можете сыграть снова. Удачи!");
//    }

    public void play(){}

}
